package ru.umar.level4;

public class task31 {
    /*
    Вывести на экран числа от 10 до 1 включительно, используя цикл while. Каждое значение с новой строки.

Требования:
•	Программа не должна считывать числа c клавиатуры.
•	Программа должна выводить числа на экран.
•	Каждое значение должно быть выведено с новой строки.
•	Программа должна выводить числа от 10 до 1 включительно.
•	В программе должен использоваться цикл while.
     */

    public static void main(String[] args) {
        int i = 11;
        while(i > 1){
            i--;
            System.out.println(i);
        }

    }
}
