package ru.umar.level4;

public class task30 {
    /*
    Вывести на экран числа от 1 до 10 включительно, используя цикл while. Каждое значение с новой строки.

Требования:
•	Программа не должна считывать числа c клавиатуры.
•	Программа должна выводить числа на экран.
•	Каждое значение должно быть выведено с новой строки.
•	Программа должна выводить числа от 1 до 10 включительно.
•	В программе должен использоваться цикл while.
     */
    public static void main(String[] args) {
        int i = 0;
        while(i < 10){
            // i++;
            System.out.println(i++);
        }

    }
}
